#for french
str1=Adolf Hitler, dirigeant du parti nazi allemand, \u00e9tait l\u2019un des dictateurs les plus puissants et notoires du XXe si\u00e8cle. Hitler capitalisa sur les d\u00e9boires \u00e9conomiques, le m\u00e9contentement populaire et les luttes politiques internes pour conqu\u00e9rir le pouvoir absolu en Allemagne \u00e0 partir de 1933. L\u2019invasion de la Pologne par l\u2019Allemagne en 1939 d\u00e9clencha la Seconde Guerre mondiale et, en 1941, les forces nazies occupaient une grande partie de l\u2019Europe. L\u2019antis\u00e9mitisme virulent de Hitler et sa qu\u00eate obsessionnelle de la supr\u00e9matie aryenne ont aliment\u00e9 le meurtre de quelque 6 millions de Juifs, ainsi que d\u2019autres victimes de l\u2019Holocauste. Hitler s'est suicid\u00e9 dans un bunker de Berlin en avril 1945, apr\u00e8s la vague de guerre qui s'opposait \u00e0 lui. Adolf Hitler est n\u00e9 le 20 avril 1889 \u00e0 Branau am Inn, une petite ville autrichienne situ\u00e9e pr\u00e8s de la fronti\u00e8re austro-allemande. Apr\u00e8s que son p\u00e8re, Alois, ait pris sa retraite en tant que fonctionnaire des douanes, le jeune Adolf a pass\u00e9 la majeure partie de son enfance \u00e0 Linz, la capitale de la Haute-Autriche. Ne voulant pas suivre les traces de son p\u00e8re en tant que fonctionnaire, il commen\u00e7a \u00e0 se battre au secondaire et finit par d\u00e9crocher. Alois mourut en 1903 et Adolf poursuivit son r\u00eave d\u2019\u00eatre un artiste, bien qu\u2019il fut rejet\u00e9 par l\u2019Acad\u00e9mie des Beaux-Arts de Vienne.
str2=Apr\u00e8s la mort de sa m\u00e8re, Klara, en 1908, Hitler s'installe \u00e0 Vienne, o\u00f9 il reconstitue un tableau et des monuments vivants et vendit les images. Hitler solitaire, isol\u00e9 et vorace, Hitler s\u2019int\u00e9ressa \u00e0 la politique au cours de ses ann\u00e9es \u00e0 Vienne et d\u00e9veloppa nombre des id\u00e9es qui fa\u00e7onneraient l\u2019id\u00e9ologie nazie. En 1913, Hitler s'installa \u00e0 Munich, dans le Land allemand de Bavi\u00e8re. Lorsque la Premi\u00e8re Guerre mondiale \u00e9clata l'\u00e9t\u00e9 suivant, il demanda avec succ\u00e8s au roi de Bavi\u00e8re d'\u00eatre autoris\u00e9 \u00e0 se porter volontaire dans un r\u00e9giment d'infanterie de r\u00e9serve. D\u00e9ploy\u00e9 en octobre 1914 en Belgique, Hitler servit tout au long de la Grande Guerre et obtint deux r\u00e9compenses pour son courage, dont la rare croix de fer de premi\u00e8re classe, qu'il portait jusqu'\u00e0 la fin de sa vie. Hitler fut bless\u00e9 \u00e0 deux reprises durant le conflit. Il fut touch\u00e9 \u00e0 la jambe lors de la bataille de la Somme en 1916 et temporairement aveugl\u00e9 par une attaque au gaz britannique pr\u00e8s d'Ypres en 1918. Un mois plus tard, il \u00e9tait en convalescence dans un h\u00f4pital de Pasewalk, dans le nord-est du pays. \u00c0 Berlin, \u00e0 l'annonce de l'armistice et de la d\u00e9faite de l'Allemagne lors de la Premi\u00e8re Guerre mondiale, Hitler en vint, comme de nombreux Allemands, \u00e0 croire que la d\u00e9faite d\u00e9vastatrice du pays pouvait \u00eatre attribu\u00e9e non pas aux Alli\u00e9s, mais \u00e0 des "tra\u00eetres" insuffisamment patriotes - un mythe saperait la R\u00e9publique de Weimar de l\u2019apr\u00e8s-guerre et pr\u00e9parerait la mont\u00e9e de Hitler.