#for chinese
str1=\u5fb7\u570b\u7d0d\u7cb9\u9ee8\u9818\u8896\u963f\u9053\u592b\u5e0c\u7279\u52d2\u662f20\u4e16\u7d00\u6700\u5f37\u5927\uff0c\u6700\u81ed\u540d\u662d\u8457\u7684\u7368\u88c1\u8005\u4e4b\u4e00\u3002\u5e0c\u7279\u52d2\u5229\u7528\u7d93\u6fdf\u56f0\u5883\uff0c\u6c11\u773e\u4e0d\u6eff\u548c\u653f\u6cbb\u5167\u9b25\u5f9e1933\u5e74\u958b\u59cb\u5728\u5fb7\u570b\u596a\u53d6\u7d55\u5c0d\u6b0a\u529b\u30021939\u5e74\u5fb7\u570b\u5165\u4fb5\u6ce2\u862d\u5c0e\u81f4\u7b2c\u4e8c\u6b21\u4e16\u754c\u5927\u6230\u7206\u767c\uff0c\u52301941\u5e74\u7d0d\u7cb9\u8ecd\u968a\u4f54\u9818\u4e86\u6b50\u6d32\u5927\u90e8\u5206\u5730\u5340\u3002\u5e0c\u7279\u52d2\u60e1\u6bd2\u7684\u53cd\u7336\u592a\u4e3b\u7fa9\u548c\u5c0d\u96c5\u5229\u5b89\u81f3\u9ad8\u7121\u4e0a\u7684\u8ffd\u6c42\uff0c\u52a9\u9577\u4e86\u5927\u7d04600\u842c\u7336\u592a\u4eba\u4ee5\u53ca\u5927\u5c60\u6bba\u7684\u5176\u4ed6\u53d7\u5bb3\u8005\u7684\u8b00\u6bba\u3002 1945\u5e744\u6708\uff0c\u5e0c\u7279\u52d2\u5728\u67cf\u6797\u63a9\u9ad4\u4e2d\u81ea\u6bba\u8eab\u4ea1\u3002\u963f\u9053\u592b\u5e0c\u7279\u52d2\u65bc1889\u5e744\u670820\u65e5\u51fa\u751f\u5728\u5967\u5730\u5229\u5fb7\u570b\u908a\u5883\u9644\u8fd1\u5967\u5730\u5229\u5c0f\u93ae\u5e03\u862d\u7459\u5e02\u3002\u5728\u4ed6\u7684\u7236\u89aa\u963f\u6d1b\u4f0a\u65af\u4f5c\u70ba\u5dde\u6d77\u95dc\u5b98\u54e1\u9000\u4f11\u4e4b\u5f8c\uff0c\u5e74\u8f15\u7684\u963f\u9053\u592b\u5728\u7ae5\u5e74\u6642\u671f\u5ea6\u904e\u4e86\u4e0a\u5967\u5730\u5229\u5dde\u9996\u5e9c\u6797\u8328\u7684\u5927\u90e8\u5206\u6642\u5149\u3002\u4ed6\u4e0d\u60f3\u8ddf\u96a8\u7236\u89aa\u4f5c\u70ba\u516c\u52d9\u54e1\u7684\u8173\u6b65\uff0c\u958b\u59cb\u5728\u4e2d\u5b78\u6399\u624e\uff0c\u6700\u7d42\u8f1f\u5b78\u3002\u963f\u6d1b\u4f0a\u65af\u65bc1903\u5e74\u53bb\u4e16\uff0c\u963f\u9053\u592b\u8ffd\u6c42\u4ed6\u4f5c\u70ba\u85dd\u8853\u5bb6\u7684\u5922\u60f3\uff0c\u5118\u7ba1\u4ed6\u88ab\u7dad\u4e5f\u7d0d\u7f8e\u8853\u5b78\u9662\u62d2\u7d55\u3002
str2=\u5728\u4ed6\u7684\u6bcd\u89aa\u514b\u62c9\u62c9\u65bc1908\u5e74\u53bb\u4e16\u5f8c\uff0c\u5e0c\u7279\u52d2\u642c\u5230\u4e86\u7dad\u4e5f\u7d0d\uff0c\u5728\u90a3\u88e1\u4ed6\u62fc\u6e4a\u4e86\u4e00\u5e45\u751f\u52d5\u7684\u7e6a\u756b\u98a8\u666f\u548c\u7d00\u5ff5\u7891\u4e26\u51fa\u552e\u4e86\u9019\u4e9b\u5716\u50cf\u3002\u5b64\u7368\uff0c\u5b64\u7acb\u548c\u8caa\u5a6a\u7684\u8b80\u8005\uff0c\u5e0c\u7279\u52d2\u5728\u7dad\u4e5f\u7d0d\u591a\u5e74\u4f86\u5c0d\u653f\u6cbb\u7522\u751f\u4e86\u8208\u8da3\uff0c\u4e26\u767c\u5c55\u4e86\u8a31\u591a\u5851\u9020\u7d0d\u7cb9\u610f\u8b58\u5f62\u614b\u7684\u60f3\u6cd5\u3002 1913\u5e74\uff0c\u5e0c\u7279\u52d2\u642c\u5230\u4e86\u5fb7\u570b\u5df4\u4f10\u5229\u4e9e\u5dde\u7684\u6155\u5c3c\u9ed1\u3002\u7b2c\u4e8c\u6b21\u4e16\u754c\u5927\u6230\u7206\u767c\u5f8c\u7684\u7b2c\u4e8c\u5e74\u590f\u5929\uff0c\u4ed6\u6210\u529f\u5730\u8acb\u6c42\u5df4\u4f10\u5229\u4e9e\u570b\u738b\u5728\u4e00\u500b\u9810\u5099\u6b65\u5175\u5718\u4e2d\u505a\u5fd7\u9858\u8005\u3002\u5e0c\u7279\u52d2\u65bc1914\u5e7410\u6708\u90e8\u7f72\u5230\u6bd4\u5229\u6642\uff0c\u5728\u6574\u500b\u7b2c\u4e00\u6b21\u4e16\u754c\u5927\u6230\u671f\u9593\u670d\u5f79\u4e26\u8d0f\u5f97\u4e86\u5169\u9805\u52c7\u6562\u7684\u88dd\u98fe\uff0c\u5176\u4e2d\u5305\u62ec\u7f55\u898b\u7684\u9435\u5341\u5b57\u982d\u7b49\u7d1a\uff0c\u4ed6\u4e00\u76f4\u7a7f\u8457\u9019\u7a2e\u88dd\u98fe\u3002\u5e0c\u7279\u52d2\u5728\u885d\u7a81\u671f\u9593\u53d7\u50b7\u5169\u6b21\uff1a\u4ed6\u57281916\u5e74\u7d22\u59c6\u6cb3\u6230\u5f79\u4e2d\u88ab\u64ca\u4e2d\u817f\u90e8\uff0c\u4e26\u65bc1918\u5e74\u5728\u4f0a\u666e\u723e\u9644\u8fd1\u7684\u82f1\u570b\u5929\u7136\u6c23\u8972\u64ca\u4e2d\u66ab\u6642\u5931\u660e\u3002\u4e00\u500b\u6708\u5f8c\uff0c\u4ed6\u5728\u6771\u5317\u90e8\u7684Pasewalk\u91ab\u9662\u4f11\u990a\u3002\u67cf\u6797\uff0c\u7576\u65b0\u805e\u5230\u4f86\u505c\u6230\u548c\u5fb7\u570b\u5728\u7b2c\u4e00\u6b21\u4e16\u754c\u5927\u6230\u4e2d\u5931\u6557\u3002\u50cf\u8a31\u591a\u5fb7\u570b\u4eba\u4e00\u6a23\uff0c\u5e0c\u7279\u52d2\u958b\u59cb\u76f8\u4fe1\u9019\u500b\u570b\u5bb6\u7684\u6bc0\u6ec5\u6027\u5931\u6557\u4e0d\u50c5\u6b78\u548e\u65bc\u540c\u76df\u570b\uff0c\u800c\u662f\u6b78\u548e\u65bc\u570b\u5167\u4e0d\u5920\u611b\u570b\u7684\u201c\u53db\u5f92\u201d - \u4e00\u500b\u795e\u8a71\u6703\u7834\u58de\u6230\u5f8c\u7684\u9b4f\u746a\u5171\u548c\u570b\uff0c\u70ba\u5e0c\u7279\u52d2\u7684\u5d1b\u8d77\u5960\u5b9a\u57fa\u790e\u3002